Fabrication part eccentric justifications for alignment for flat edged parts.
  Namespace:   Autodesk.Revit.DB.Fabrication
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
  Since:  2018
 Syntax
  C#
public enum FabricationPartJustification
  Visual Basic
Public Enumeration FabricationPartJustification
  Visual C++
public enum class FabricationPartJustification
 Members
  Member name  |   Description
   Middle   |   Default middle justification to the connector
   Bottom   |   Outside edge justification to the bottom
   Top   |   Outside edge justification to the top
 See Also
  Autodesk.Revit.DB.Fabrication Namespace